# PickSupport Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeEditor..::..PickSupport Method
SlabShapeEditor Class See Also
---
Picks an element to support the slab. This method will define split lines and create constant bearing lines for the slab.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void PickSupport(
	Line gLine
)
```

Visual Basic
---
```text
Public Sub PickSupport ( _
	gLine As Line _
)
```

Visual C++
---
```text
public:
void PickSupport(
	Line^ gLine
)
```

# ### Parameters
gLine
    Type: Autodesk.Revit.DB..::..LineA line from a support element such as a beam.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input line is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the input line is invalid. |

# See Also
SlabShapeEditor Class
Autodesk.Revit.DB Namespace